zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW727C/drivers/fsl_clock.h
    uint8_t trimCoar;              /*!< Trim coarse value; Irrelevant if trimMode is kSCG_FircTrimUpdate. */
    uint8_t trimFine;              /*!< Trim fine value; Irrelevant if trimMode is kSCG_FircTrimUpdate. */
} scg_firc_trim_config_t;

/*! @brief FIRC enable mode. */
enum
{
    kSCG_FircDisable       = 0,                         /*!< Disable FIRC clock.             */
    kSCG_FircEnable        = SCG_FIRCCSR_FIRCEN_MASK,   /*!< Enable FIRC clock.              */
    kSCG_FircEnableInSleep = SCG_FIRCCSR_FIRCSTEN_MASK, /*!< Enable FIRC in sleep mode.      */
};

/*!
 * @brief SCG fast IRC clock frequency range.
 */
typedef enum _scg_firc_range
{
    kSCG_FircRange48M,  /*!< Fast IRC is trimmed to 48 MHz. */
    kSCG_FircRange64M,  /*!< Fast IRC is trimmed to 64 MHz. */
    kSCG_FircRange96M,  /*!< Fast IRC is trimmed to 96 MHz. */
    kSCG_FircRange192M, /*!< Fast IRC is trimmed to 192 MHz. */
} scg_firc_range_t;

/*!
 * @brief SCG fast IRC clock configuration.
 */
typedef struct _scg_firc_config_t
{
    uint32_t enableMode;                      /*!< Enable mode. */
    scg_firc_range_t range;                   /*!< Fast IRC frequency range. */

    const scg_firc_trim_config_t *trimConfig; /*!< Pointer to the FIRC trim configuration; set NULL to disable trim. */
} scg_firc_config_t;

/*!
 * @brief FRO192M RF clock frequency range.
 */
typedef enum _fro192m_rf_range
{
    kFro192M_Range16M, /*!< FRO192M output frequenc 16 MHz. */
    kFro192M_Range24M, /*!< FRO192M output frequenc 24 MHz. */
    kFro192M_Range32M, /*!< FRO192M output frequenc 32 MHz. */
    kFro192M_Range48M, /*!< FRO192M output frequenc 48 MHz. */
    kFro192M_Range64M, /*!< FRO192M output frequenc 64 MHz. */
} fro192m_rf_range_t;

/*!
 * @brief RF Flash APB and RF_CMC clock divide.
 */
typedef enum _fro192m_rf_clk_div
{
    kFro192M_ClkDivBy1 = 0U, /*!< Divided by 1. */
    kFro192M_ClkDivBy2 = 1U, /*!< Divided by 2. */
    kFro192M_ClkDivBy4 = 2U, /*!< Divided by 4. */
    kFro192M_ClkDivBy8 = 3U, /*!< Divided by 8. */
} fro192m_rf_clk_div_t;

/*!
 * @brief FRO192M RF clock configuration.
 */
typedef struct _fro192m_rf_clk_config
{
    fro192m_rf_range_t range;           /*!< FRO192M RF clock frequency range. */
    fro192m_rf_clk_div_t apb_rfcmc_div; /*!< RF Flash APB and RF_CMC clock divide. */
} fro192m_rf_clk_config_t;

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */

/*!
 * @brief Enable the clock for specific IP.
 *
 * @param name  Which clock to enable, see \ref clock_ip_name_t.
 */
static inline void CLOCK_EnableClock(clock_ip_name_t name)
{
    if (kCLOCK_NOGATE == name)
    {
        return;
    }

    uint32_t reg = CLOCK_REG(name);

    if (0x0u != (reg & MRCC_CC_MASK))
    {
        return;
    }

    CLOCK_REG(name) &= (~MRCC_CC_MASK);
    CLOCK_REG(name) |= (MRCC_CC_MASK & (uint32_t)kCLOCK_IpClkControl_fun1);

    if ((CLOCK_REG(name) & MRCC_PR_MASK) == MRCC_PR_MASK)
    {
        CLOCK_REG(name) |= MRCC_RSTB_MASK;
    }

    /* Make sure enable clock finished */
    __ISB();
    __DSB();
}

/*!
 * @brief Enable the TPM2 clock.
 */
static inline void CLOCK_EnableTPM2(void)
{
    RF_CMC1->TPM2_CFG |= RF_CMC1_TPM2_CFG_CGC(1U);
}

/*!
 * @brief Enable the clock for specific IP in low power mode.
 *
 * @param name  Which clock to enable, see \ref clock_ip_name_t.
 * @param control  Clock Config, see \ref clock_ip_control_t.
 */
static inline void CLOCK_EnableClockLPMode(clock_ip_name_t name, clock_ip_control_t control)
{
    if (kCLOCK_NOGATE == name)
    {
        return;
    }

    assert(kCLOCK_IpClkControl_fun1 == control || kCLOCK_IpClkControl_fun2 == control ||
           kCLOCK_IpClkControl_fun3 == control);

    CLOCK_REG(name) &= (~MRCC_CC_MASK);
    CLOCK_REG(name) |= (MRCC_CC_MASK & (uint32_t)control);

    if ((CLOCK_REG(name) & MRCC_PR_MASK) == MRCC_PR_MASK)
    {
        CLOCK_REG(name) |= MRCC_RSTB_MASK;
    }

    /* Make sure enable clock finished */
    __ISB();
    __DSB();
}

/*!
 * @brief Disable the clock for specific IP.
 *
 * @param name  Which clock to disable, see \ref clock_ip_name_t.
 */
static inline void CLOCK_DisableClock(clock_ip_name_t name)
{
    if (kCLOCK_NOGATE == name)
    {
        return;
    }

    CLOCK_REG(name) &= (uint32_t)kCLOCK_IpClkControl_fun0;

    if ((CLOCK_REG(name) & MRCC_PR_MASK) == MRCC_PR_MASK)
    {
        CLOCK_REG(name) &= ~MRCC_RSTB_MASK;
    }
}

/*!
 * @brief Disable the TPM2 clock.
 */
static inline void CLOCK_DisableTPM2(void)
{
    RF_CMC1->TPM2_CFG &= ~RF_CMC1_TPM2_CFG_CGC(1U);
}

/*!
 * @brief Set the clock source for specific IP module.
 *
 * Set the clock source for specific IP, not all modules need to set the
 * clock source, should only use this function for the modules need source
 * setting.
 * ERR052742: FRO6M clock is not stable.
 * The FRO6M clock is not stable on some parts. FRO6M outputs lower frequency
 * signal instead of 6MHz when device is reset or wakes up from low power.
 * It can impact peripherals using it as a clock source. Please use clock source
 * other than the FRO6M. For example, use FRO192M instead of FRO6M as clock
 * source for peripherals.
 *
 * @param name Which peripheral to check, see \ref clock_ip_name_t.
 * @param src Clock source to set.
 */
static inline void CLOCK_SetIpSrc(clock_ip_name_t name, clock_ip_src_t src)
{
    if (kCLOCK_NOGATE == name)
    {
        return;
    }

    if (src < kCLOCK_IpSrcFro6M || src > kCLOCK_IpSrc32kClk)
    {
        return;
    }

    uint32_t reg = CLOCK_REG(name);

    assert(0U != (reg & MRCC_PR_MASK));

    reg = (reg & (~MRCC_MUX_MASK)) | MRCC_MUX(src);

    /*
     * If clock is already enabled, first disable it, then set the clock
     * source and re-enable it.
     */
    CLOCK_REG(name) = reg & (~MRCC_CC_MASK);
    CLOCK_REG(name) = reg;
}

/*!
 * @brief Set the clock source for TPM2.
 *
 * @param src Clock source to set.
 */
static inline void CLOCK_SetTpm2Src(tpm2_src_t src)
{
    uint32_t reg = RF_CMC1->TPM2_CFG;

